from flask import Flask, jsonify
import random

app = Flask(_name_)

quotes = [
  {
    "text": "熟田津に\n船乗りせむと\n月待てば\n潮もかなひぬ\n今は漕ぎ出でな",
    "author": "額田王",
    "era": "飛鳥時代"
  },
  {
    "text": "楽浪の\n志賀の唐崎\n幸くあれど\n大宮人の\n船待ちかねつ",
    "author": "柿本人麻呂",
    "era": "飛鳥時代"
  },
  {
    "text": "世の中を\n憂しとやさしと\n思へども\n飛び立ちかねつ\n鳥にしあらねば",
    "author": "山上憶良",
    "era": "奈良時代"
  },
  {
    "text": "うらうらに\n照れる春日に\n雲雀上がり\n情悲しも\n独りし思へば",
    "author": "大伴家持",
    "era": "奈良時代"
  },
  {
    "text": "月やあらぬ\n春や昔の\n春ならぬ\nわが身ひとつは\nもとの身にして",
    "author": "在原業平",
    "era": "平安時代"
  },
  {
    "text": "思ひつつ\n寝ればや人の\n見えつらむ\n夢としりせば\nさめざらましを",
    "author": "小野小町",
    "era": "平安時代"
  },
  {
    "text": "桜花\nちりぬる風の\nなごりには\n水なき空に\n浪ぞたちける",
    "author": "紀貫之",
    "era": "平安時代"
  },
  {
    "text": "黒髪の\n乱れも知らず\nうち臥せば\nまづかきやりし\n人ぞ恋しき",
    "author": "和泉式部",
    "era": "平安時代"
  },
  {
    "text": "年たけて\nまたこゆべしと\n思ひきや\n命なりけり\n佐夜の中山",
    "author": "西行",
    "era": "平安時代"
  },
  {
    "text": "玉の緒よ\n絶えなば絶えね\nながらへば\n忍ぶることの\n弱りもぞする",
    "author": "式子内親王",
    "era": "鎌倉時代"
  },
  {
    "text": "夕されば\n野辺の秋風\n身にしみて\n鶉鳴くなり\n深草の里",
    "author": "藤原俊成",
    "era": "鎌倉時代"
  },
  {
    "text": "春の夜の\n夢の浮橋\nと絶えして\n峰にわかるる\n横雲の空",
    "author": "藤原定家",
    "era": "鎌倉時代"
  },
  {
    "text": "ながめつつ\n思ふも寂し\nひさかたの\n月の都の\n明け方の空",
    "author": "藤原家隆",
    "era": "鎌倉時代"
  },
  {
    "text": "箱根路を\nわれこえくれば\n伊豆のうみや\n沖の小島に\n波の寄る見ゆ",
    "author": "源実朝",
    "era": "鎌倉時代"
  },
  {
    "text": "花の上に\nしばしうつろふ\n夕づく日\n入るともなしに\n影きえにけり",
    "author": "永福門院",
    "era": "鎌倉時代"
  },
  {
    "text": "霞立つ\nながき春日を\n子どもらと\n手まりつきつつ\nこの日暮らしつ",
    "author": "良寛",
    "era": "江戸時代"
  },
  {
    "text": "たのしみは\nまれに魚烹て\n児等皆が\nうましうましと\nいひて食ふ時",
    "author": "橘曙覧",
    "era": "江戸時代"
  },
  {
    "text": "春みじかし\n何に不滅の\n命ぞと\nちからある乳を\n手にさぐらせぬ",
    "author": "与謝野晶子",
    "era": "明治時代"
  },
  {
    "text": "馬追虫の\n髭のそよろに\n来る秋は\nまなこを閉ぢて\n想ひ見るべし",
    "author": "長塚節",
    "era": "明治時代"
  },
  {
    "text": "後世は猶\n今生だにも\n願はざる\nわがふところに\nさくら来てちる",
    "author": "山川登美子",
    "era": "明治時代"
  }

]


@app.route('/api/kotonoha', methods=['GET'])
def get_kotonoha():
    return jsonify(random.choice(quotes))

if __name__ == '__main__':
    app.run()